Repository: skillAndroid/ListInFlutter
Catalog: lib/l10n/app_*.arb
Languages: uz

source: Language
uz: Til

# createAccount
source: Create an Account
uz: Akkaunt yaratish

source: Log In
uz: Kirish

# listInWorld
source: Welcome to ListIn World
uz: ListIn-ga xush kelibsiz

source: Welcome Back
uz: Yana qaytganingiz bilan

# welcomeMessage
source: We are happy to see you here again. Enter your email address and password.
uz: Sizni yana ko'rib turganimizdan xursandmiz. Elektron pochtangiz va parolingizni kiriting.

# emailBig
source: Email
uz: Elektron pochta

# enterEmail
source: Please enter your email
uz: Iltimos, elektron pochtangizni kiriting

source: Password
uz: Parol

# enterPassword
source: Please enter your password
uz: Iltimos, parolingizni kiriting

source: Forgot Password?
uz: Parolni unutdingizmi?

source: or
uz: yoki

# alreadyHaveAccount
source: Already have an account?
uz: Allaqachon akkauntingiz bormi?

source: Continue with Apple
uz: Apple orqali davom etish

source: Continue with Facebook
uz: Facebook orqali davom etish

source: Continue with Google
uz: Google orqali davom etish

# continuee
source: Continue
uz: Davom etish

# createAccountMessage
source: Create an account, it takes less than a minute. Enter your email and password.
uz: Akkaunt yarating, bu bir daqiqadan kam vaqt oladi. Elektron pochtangiz va parolingizni kiriting.

source: Verify Email!
uz: Emailni tasdiqlang!

# verificationSent
source: We sent a verification code to your
uz: Tasdiqlash kodi quyidagi manzilga yuborildi:

source: email
uz: elektron pochta

# verificationCodeEmpty
source: Verification code is empty
uz: Tasdiqlash kodi bo'sh

source: Fill all boxes
uz: Barcha kataklarni to'ldiring

source: Verify
uz: Tasdiqlash

source: Didn't get code?
uz: Kod olmadingizmi?

source: Resend
uz: Qayta yuborish

# sellPersonalItems
source: Simple User
uz: Oddiy foydalanuvchi

# sellPersonalItemsDesc
source: Easily buy and sell items as an individual.
uz: Mahsulotlarni oson sotib oling yoki soting.

# createStore
source: Business Platform
uz: Biznes platformasi

# createStoreDesc
source: Create a business for selling, renting, or offering services.
uz: Savdo, ijaraga berish va xizmatlar uchun biznes yarating.

# fillRequiredFields
source: Please fill all required fields
uz: Iltimos, barcha kerakli maydonlarni to'ldiring

# selectLocation
source: Please select a location
uz: Iltimos, joylashuvni tanlang

source: Submit
uz: Tasdiqlash

source: What can we call you?
uz: Sizni qanday chaqirishimiz mumkin?

# enterYourName
source: Please enter your name, company name, or a nickname.
uz: Ismingizni, kompaniya nomini yoki taxallusingizni kiriting.

# exampleNames
source: John Doe, Nike, or YourNickname
uz: John Doe, Nike yoki YourNickname

# nameEmpty
source: Name can't be empty
uz: Ism bo'sh bo'lishi mumkin emas

source: What are you looking for?
uz: Nimani qidiryapsiz?

# selectPreference
source: Please select your preference.
uz: Iltimos, tanlovingizni belgilang.

source: Your Phone Number
uz: Telefon raqamingiz

# enterPhoneNumber
source: Enter your phone number to stay connected.
uz: Aloqada qolish uchun telefon raqamingizni kiriting.

source: Phone Number
uz: Telefon raqami

# enterPhoneNumberPrompt
source: Please enter your phone number
uz: Iltimos, telefon raqamingizni kiriting

source: Secure Your Account
uz: Hisobingizni himoya qiling

# createStrongPassword
source: Create a strong password.
uz: Kuchli parol yarating.

# passwordMinLength
source: Password must be at least 6 characters
uz: Parol kamida 6 ta belgidan iborat bo'lishi kerak

source: Select Your Location
uz: Joylashuvingizni tanlang

# tapToSelectLocation
source: Tap to select your location on the map.
uz: Joylashuvingizni xaritada tanlash uchun bosing.

source: No Location selected
uz: Joylashuv tanlanmagan

source: Exact Location
uz: Aniq joylashuv

source: Region Only
uz: Faqat hudud

# exactLocationDesc
source: • Shares exact coordinates • Most accurate for precise services
uz: • Aniq koordinatalarni ulashadi • Aniqlik talab qiladigan xizmatlar uchun eng mos

# regionOnlyDesc
source: • Shares general area • Protects specific location details
uz: • Umumiy hududni ulashadi • Aniq manzilni himoya qiladi

source: Open Map
uz: Xaritani ochish

# couldNotOpenMaps
source: Could not open maps. Please check if you have Google Maps installed or try again later.
uz: Xaritalarni ochib bo'lmadi. Iltimos, Google Xaritalar o'rnatilganligini tekshiring yoki qayta urinib ko'ring.

source: Get Direction
uz: Yo'nalishni olish

# selectLocationBtn
source: Select Location
uz: Joylashuvni tanlash

source: Selected Location
uz: Tanlangan joylashuv

source: Loading...
uz: Yuklanmoqda...

# selectLocationFirst
source: Please select a location first
uz: Iltimos, avval joylashuvni tanlang

source: Ready
uz: Tayyor

source: Enter your location
uz: Joylashuvingizni kiriting

source: Could not launch maps
uz: Xaritani ishga tushirib bo'lmadi

source: Map
uz: Xarita

source: Search
uz: Qidirish

source: Rating
uz: Baholash

source: Reviews
uz: Sharhlar

source: Unfollow
uz: Kuzatmaslik

source: Follow
uz: Kuzatish

# condition_new
source: New
uz: Yangi

# condition_used
source: Used
uz: Ishlatilgan

source: Write to Telegram
uz: Telegramga yozish

source: Call Now
uz: Hozir qo'ng'iroq qiling

source: Edit Post
uz: Tahrirlash

source: Delete
uz: O'chirish

source: Location Privacy Enabled
uz: Joylashuv maxfiyligi yoqilgan

# location_privacy_description
source: This seller has chosen to keep their exact location private. This is a safety feature that helps protect our community members. You can still see their approximate location area for delivery planning.
uz: Sotuvchi o'zining aniq joylashuvini maxfiy saqlashni tanladi. Bu bizning jamoamiz a'zolarini himoya qilish uchun xavfsizlik xususiyatidir. Siz hali ham taxminiy joylashuvni yetkazib berish uchun ko'rishingiz mumkin.

source: Enhanced Safety
uz: Kuchaytirilgan xavfsizlik

# protects_privacy
source: Protects personal privacy and security
uz: Shaxsiy maxfiylik va xavfsizlikni himoya qiladi

source: Area Visible
uz: Hudud ko'rinadi

# general_location_shown
source: General location area is still shown
uz: Umumiy joylashuv hududi hali ham ko'rsatilgan

source: Got it
uz: Tushundim

source: Description
uz: Tavsif

source: About this item
uz: Bu mahsulot haqida

source: Boost Publication
uz: E'lonni ko'tarish

source: Delete Publication
uz: E'lonni o'chirish

source: Publication Options
uz: E'lon sozlamalari

# choose_action
source: Choose an action for this publication
uz: Ushbu e'lon uchun amalni tanlang

# delete_confirmation
source: Are you sure you want to delete this publication? This action cannot be undone.
uz: Haqiqatan ham ushbu e'lonni o'chirmoqchimisiz? Bu amalni qaytarib bo'lmaydi.

source: Cancel
uz: Bekor qilish

source: Boost Unavailable
uz: Ko'tarish mavjud emas

# boost_unavailable_description
source: Publication boosting is a premium feature that is not yet supported. Stay tuned for updates!
uz: E'lonni ko'tarish premium xususiyat bo'lib, hozircha qo'llab-quvvatlanmaydi. Yangiliklarni kuzatib boring!

# error_call
source: Error: Unable to launch call to Exception:
uz: Xatolik: Exception uchun qo'ng'iroqni amalga oshirib bo'lmadi:

source: Your post
uz: Sizning e'loningiz

source: User other posts
uz: Foydalanuvchining boshqa e'lonlari

source: Retry
uz: Qayta urinish

source: No publications available
uz: Hech qanday e'lon mavjud emas

source: Condition
uz: Holat

# unknown_error
source: An unknown error occurred
uz: Noma'lum xato yuz berdi

source: No items found
uz: Hech narsa topilmadi

source: What are you looking for?
uz: Nima qidiryapsiz?

source: Clear
uz: Tozalash

source: Filter
uz: Filtr

source: Category
uz: Kategoriya

source: Searching
uz: Qidirish

source: Additional
uz: Qo'shimcha

source: Apply
uz: Qo‘llash

source: Seller Type
uz: Sotuvchi turi

source: Individual
uz: Jismoniy shaxs

source: Shop
uz: Do‘kon

source: All
uz: Hammasi

source: Sorting
uz: Saralash

source: Bargain
uz: Kelishish mumkin

source: For Free
uz: Bepul

source: Location
uz: Joylashuv

source: Show more than
uz: Ko'proq ko'rsatish

source: Publications
uz: E’lonlar

source: Show
uz: Ko'rsatish

source: Price range
uz: Narx oralig‘i

source: No results in range
uz: Bu oraliqda natijalar yo‘q

source: Recent
uz: Yaqinda

source: Season Fashion
uz: Mavsumiy moda

source: Gift Ideas
uz: Sovg'a g'oyalari

source: Oops! Something went wrong
uz: Voy! Nimadir xato ketdi

source: Try Again
uz: Qayta urinib ko'ring

source: Video Posts
uz: Video postlar

# search_3dots
source: Search...
uz: Qidirish...

source: Is Free
uz: Bepul

source: Price
uz: Narx

source: From
uz: Dan

source: To
uz: Gacha

# from_value_error
source: From value must be less than or equal to To value
uz: 'Dan' qiymati 'Gacha' qiymatidan kichik yoki teng bo‘lishi kerak

source: Image not found
uz: Rasm topilmadi

source: Logo not found
uz: Logo topilmadi

source: Not Available
uz: Mavjud emas

source: View in Profile
uz: Profilda ko‘rish

source: Profile
uz: Profil

# cant_call_own_number
source: You can't call your own number
uz: Siz o'z raqamingizga qo‘ng‘iroq qila olmaysiz

source: Call
uz: Qo‘ng‘iroq qilish

source: Go to Profile
uz: Profilga o'tish

source: Change
uz: O'zgartirish

source: Enter value
uz: Qiymatni kiriting

# phone_number_not_required
source: Phone number is not required
uz: Telefon raqami majburiy emas

# enter_valid_uzbekistan_number
source: Enter valid Uzbekistan number: +998XXXXXXXXX
uz: Yaroqli O‘zbekiston raqamini kiriting: +998XXXXXXXXX

source: Contact Information
uz: Aloqa ma'lumotlari

# update_contact_info
source: Want to update your contact info? Changes here will sync with your profile (optional)
uz: Aloqa ma'lumotlarini yangilamoqchimisiz? O‘zgarishlar profilingiz bilan sinxronlanadi (ixtiyoriy)

source: Update Profile Settings
uz: Profil sozlamalarini yangilash

source: Phone Number (Optional)
uz: Telefon raqami (ixtiyoriy)

source: Call Settings
uz: Qo‘ng‘iroq sozlamalari

source: Allow Calls
uz: Qo‘ng‘iroqlarga ruxsat berish

source: Preferred Call Time
uz: Afzal qilingan qo‘ng‘iroq vaqti

source: Select
uz: Tanlash

# description_required
source: Description is required
uz: Tavsif majburiy

# description_min_length
source: Description must be at least 30 characters
uz: Tavsif kamida 30 ta belgidan iborat bo‘lishi kerak

# description_max_length
source: Description cannot exceed 2500 characters
uz: Tavsif 2500ta belgidan oshmasligi kerak

source: Next, add description
uz: Keyingi bosqich: Tavsif qo‘shing

# example_description
source: For example: Selling iPhone 15 Pro, unused and silver color
uz: Masalan: iPhone 15 Pro sotilmoqda, ishlatilmagan va kumush rang

source: Main
uz: Asosiy

source: Upload Images
uz: Rasmlarni yuklash

# upload_images_tip
source: Tip: The first photo will be featured as your main image. Simply drag and drop photos to change their order.
uz: Maslahat: Birinchi rasm asosiy rasm sifatida namoyon bo‘ladi. Tartibni o‘zgartirish uchun rasmlarni sudrab qo‘ying.

source: Upload product photo(s)
uz: Mahsulot rasmlarini yuklash

# image_format
source: Format JPG or PNG
uz: JPG yoki PNG formati

source: Upload Video
uz: Video yuklash

# upload_video_tip
source: Attract more buyers with a quick showcase
uz: Sotuvchilar e'tiborini jalb qilish uchun qisqa taqdimot qo‘shing

# video_orientation_tip
source: Tip: Use vertical (9:16) orientation for your videos to best suit the application
uz: Maslahat: Ilovaga mos bo‘lishi uchun vertikal (9:16) formatdan foydalaning

source: Upload product video
uz: Mahsulot videosini yuklash

# max_video_duration
source: Max video duration 1:30 min
uz: Maksimal video davomiyligi 1:30 daqiqa

# price_greater_than_zero
source: Price must be greater than 0
uz: Narx 0 dan katta bo‘lishi kerak

# price_too_high
source: Price is too high
uz: Narx juda yuqori

# enter_price
source: Great! Please enter price
uz: Ajoyib! Narxni kiriting

# negotiable_price_info
source: You can set a fixed price or make it negotiable. Enable this option if you are open to discussing the price with the buyer.
uz: Belgilangan narx yoki kelishiladigan narx o‘rnatishingiz mumkin. Agar xaridor bilan narxni muhokama qilishga tayyor bo‘lsangiz, ushbu opsiyani yoqing.

source: Negotiable Price?
uz: Kelishilgan narx?

# product_condition
source: What's the condition of your product?
uz: Mahsulotning holati qanday?

# unused_product
source: Unused product with original packaging
uz: Ishlatilmagan mahsulot, asl qadoqlangan

# used_product
source: Product has been used before
uz: Avval foydalanilgan mahsulot

# title_required
source: Title is required
uz: Sarlavha majburiy

# title_min_length
source: Title must be at least 8 characters
uz: Sarlavha kamida 10ta belgidan iborat bo‘lishi kerak

# add_title_now
source: Ok! Add title now...
uz: Ok! Endi sarlavha qo‘shing...

# example_title
source: For example: iPhone 15 Pro
uz: Masalan: iPhone 15 Pro

# title_min_length_warning
source: Title must be at least 8 characters long
uz: Sarlavha kamida 7 ta belgidan iborat bo‘lishi kerak

# description_min_length_warning
source: Description must be at least 30 characters long
uz: Tavsif kamida 30 ta belgidan iborat bo‘lishi kerak

# enter_valid_price
source: Please enter a valid price
uz: Yaroqli narxni kiriting

# select_condition
source: Please select a condition
uz: Iltimos, holatni tanlang

# add_at_least_one_image
source: Please add at least one image
uz: Kamida bitta rasm qo‘shing

source: Create Post
uz: E'lon yaratish

source: Next
uz: Keyingi

# post_creation_failed
source: Failed to create post
uz: E'lonni yaratish muvaffaqiyatsiz tugadi

# post_creation_success
source: Publication created successfully!
uz: E'lon muvaffaqiyatli yaratildi!

source: Uploading Images...
uz: Rasmlar yuklanmoqda...

source: Uploading Video...
uz: Video yuklanmoqda...

source: Creating Post...
uz: E'lon yaratilmoqda...

source: Please wait...
uz: Iltimos, kuting...

source: Confirm
uz: Tasdiqlash

source: Currency: UZS
uz: Valyuta: UZS

source: Selected
uz: Tanlangan

source: Favorites
uz: Sevimlilar

source: My Publications
uz: Mening e'lonlarim

# no_user_data
source: No user data available
uz: Foydalanuvchi ma'lumotlari mavjud emas

# no_biography
source: No biography yet!
uz: Hali biografiya yo'q!

source: Posts
uz: E'lonlar

# help_idea
source: Help us with your idea
uz: G'oyangiz bilan yordam bering

source: Support
uz: Qo‘llab-quvvatlash

source: Logout
uz: Chiqish

# image_pick_failed
source: Failed to pick image. Please try again.
uz: Rasmni tanlashda xatolik. Iltimos, qaytadan urinib ko'ring.

source: Updating...
uz: Yangilanmoqda...

source: Done
uz: Tayyor

source: Change Profile Photo
uz: Profil rasmini o'zgartirish

source: YOUR BIOGRAPHY!
uz: SIZNING BIOGRAFIYANGIZ!

# profile_info
source: PROFILE INFORMATION
uz: PROFIL MA'LUMOTLARI

# enter_name
source: Enter your name
uz: Ismingizni kiriting

source: Name
uz: Ism

source: WORKING HOURS
uz: ISH VAQTLARI

source: Opening Time
uz: Ochilish vaqti

source: Select Time
uz: Vaqtni tanlang

source: Closing Time
uz: Yopilish vaqti

source: ACCOUNT TYPE
uz: HISOB TURi

source: Business Account
uz: Biznes hisobi

# business_features_active
source: Business features are currently active
uz: Biznes funksiyalari hozircha yoqilgan

# switch_to_business
source: Switch to business account to access additional features
uz: Qo'shimcha funksiyalarga kirish uchun biznes hisobga o'ting

# write_about_yourself
source: Write something about yourself...
uz: O'zingiz haqida biror narsa yozing...

source: Take Photo
uz: Rasmga olish

source: Choose from Library
uz: Kutubxonadan tanlash

# location_updated
source: Location updated to:
uz: Joylashuv yangilandi:

source: Presets
uz: Oldindan o‘rnatilgan vaqtlar

source: active
uz: faol

# publication_updated
source: Publication updated successfully!
uz: E'lon muvaffaqiyatli yangilandi!

source: Update Post
uz: E'lonni yangilash

source: am
uz: ertalab

source: pm
uz: kechqurun

source: Existing Images
uz: Mavjud rasmlar

# keep_existing_images
source: Do you want to keep the existing images?
uz: Mavjud rasmlarni saqlab qolasizmi?

source: Replace All
uz: Hammasini almashtirish

source: Keep Both
uz: Ikkalasini ham saqlash

source: Followers
uz: Obunachilar

source: Following
uz: Obunalar

source: Update
uz: Yangilash

source: Show Exact Location
uz: Aniq joylashuvni ko'rsatish

source: Phone
uz: Telefon

# location_bg
source: LOCATION
uz: JOYLASHUV

source: Edit Profile
uz: Profilni tahrirlash

source: An error occurred
uz: Xatolik yuz berdi

source: Error
uz: Xatolik

source: No Location
uz: Joylashuv yo‘q

source: Not Selected
uz: Tanlanmagan

# title_max_length
source: Title cannot exceed 70 characters
uz: Sarlavha 70 ta belgidan oshishi mumkin emas

source: Error initializing video
uz: Video ishga tushirishda xato

source: Add Post
uz: Post qo'shish

source: You
uz: Siz

source: See All Videos
uz: Barcha videolarni ko'rish

source: Store
uz: Do'kon

source: No user name
uz: Foydalanuvchi nomi yo'q

source: User
uz: Foydalanuvchi

source: About
uz: Biz haqimizda

# reviews_big
source: Reviews
uz: Sharhlar

source: No reviews yet!
uz: Hali sharhlar yo'q!

source: User posts
uz: Foydalanuvchi postlari

source: About us
uz: Biz haqimizda

source: No information available
uz: Ma'lumot mavjud emas

source: Available Hours
uz: Ish vaqti

source: Member since:
uz: A'zo bo'lgan sana:

source: Share Profile
uz: Profilni ulashish

source: Share Location
uz: Manzilni ulashish

source: Share Phone Number
uz: Telefon raqamini ulashish

source: Share Profile Image
uz: Profil rasmini ulashish

source: Share
uz: Ulashish

# logout_confirmation
source: Are you sure you want to logout?
uz: Chiqishni xohlaysizmi?

source: Yes
uz: Ha

# password_empty
source: Please enter a password
uz: Iltimos, parol kiriting

# password_min_length
source: Password must be at least 6 characters
uz: Parol kamida 6 ta belgidan iborat bo'lishi kerak

# phone_number_empty
source: Please enter your phone number
uz: Iltimos, telefon raqamingizni kiriting

source: Social Login Not Available
uz: Ijtimoiy tarmoqlar orqali kirish mavjud emas

# socialLoginMessage
source: Social login options are not supported currently. Please register using your email address.
uz: Ijtimoiy tarmoqlar orqali kirish hozirda qo'llab-quvvatlanmaydi. Iltimos, elektron pochta manzilingizdan foydalanib ro'yxatdan o'ting.

source: Got it
uz: Tushundim

# chatComingSoon
source: Chat Feature
uz: Chat funksiyasi

# chatInDevelopmentMessage
source: In-app chat is coming soon. Currently available via Telegram only.
uz: Ilovadagi chat tez kunda qo'shiladi. Hozirda faqat Telegram orqali mavjud.
